Revit 2027 API
BuiltInFailures.MEPCalculationFailures.NetworkErrorCalculatingPressure Property
 The pressure calculation could not be performed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NetworkErrorCalculatingPressure { get; }
Public Shared ReadOnly Property NetworkErrorCalculatingPressure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NetworkErrorCalculatingPressure {
	FailureDefinitionId^ get ();
}
static member NetworkErrorCalculatingPressure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace